       >>SOURCE FORMAT FREE
       IDENTIFICATION DIVISION.
       PROGRAM-ID. coby.
       AUTHOR. Freyr Gudjonsson.
       DATE-WRITTEN. July 20th 2024
       ENVIRONMENT DIVISION.

       DATA DIVISION.
        FILE SECTION.
        WORKING-STORAGE SECTION.
      *> 
      *> PUT YOUR VARIABLES HERE BRO
      *>




       PROCEDURE DIVISION.
      *> 
      *> PUT YOUR WORKING CODE HERE
      *> 




           STOP RUN.
